import fetch from 'node-fetch';
const handler = async (m, {conn, usedPrefix, usedPrefix: _p, __dirname, text, isPrems}) => {
  try {
  if (usedPrefix == 'a' || usedPrefix == 'A') return;

const d = new Date(new Date + 3600000);
    const locale = 'ar';
    const week = d.toLocaleDateString(locale, {weekday: 'long'});
    const date = d.toLocaleDateString(locale, {day: 'numeric', month: 'long', year: 'numeric'});
    const _uptime = process.uptime() * 1000;
    const uptime = clockString(_uptime);
    const user = global.db.data.users[m.sender];
    const {money, joincount} = global.db.data.users[m.sender];
    const {exp, limit, level, role} = global.db.data.users[m.sender];
    const totalreg = Object.keys(global.db.data.users).length;
    const rtotalreg = Object.values(global.db.data.users).filter((user) => user.registered == true).length;
    const more = String.fromCharCode(8206);
    const readMore = more.repeat(850);
    const taguser = '@' + m.sender.split('@s.whatsapp.net')[0];
    const doc = ['pdf', 'zip', 'vnd.openxmlformats-officedocument.presentationml.presentation', 'vnd.openxmlformats-officedocument.spreadsheetml.sheet', 'vnd.openxmlformats-officedocument.wordprocessingml.document'];
  const pp = await conn.profilePictureUrl(conn.user.jid).catch(_ => 'https://telegra.ph/file/278d4552ebe00f5d279b5.jpg','https://telegra.ph/file/8637bddcaaad561c26233.jpg');
  const fkon = { key: { fromMe: false, participant: `0@s.whatsapp.net`, ...(m.chat ? { remoteJid: `status@broadcast` } : {}) }, message: { 'contactMessage': { 'displayName': wm, 'vcard': `BEGIN:VCARD\nVERSION:3.0\nN:XL;${wm},;;;\nFN:${wm},\nitem1.TEL;waid=${m.sender.split('@')[0]}:${m.sender.split('@')[0]}\nitem1.X-ABLabell:Ponsel\nEND:VCARD`, 'jpegThumbnail': imagen1, thumbnail: imagen1 ,sendEphemeral: true}}};
    await conn.reply(m.chat, 'يـتـم تـجـهيـز الـقـائـمـه⏳*',m, { contextInfo:{ forwardingScore: 2022, isForwarded: true, externalAdReply: {title: '✧ 𝑀𝑖𝑡𝑠𝑢𝑟𝑖 𝐵𝑜𝑡 🌸✨', body: 'bienvenido', sourceUrl: global.md, thumbnail: await (await fetch(pp)).buffer() }}})
//m.react('📂');
    await conn.sendMessage(m.chat, { react: { text: '📂', key: m.key } })
  let txt = `
*┐–––––––––––––––––✥ـ*
*│ـ『 WhatsApp Bot  』*
*┐┬❖ـ 『  M I T S U R I   B O T 』*
*┊┤●👤┃ المستخدم اهلا بك:*
*┊│ـ⎙* ${taguser}
*┊│●📍┃الاصدار:* 1.7.0
*┊│●⏰┃وقت التشغيل:* ${uptime} 
*┊│●🌎┃المستخدمين:* ${rtotalreg}
*┊│●🏓┃النظام:* games - العاب
*┊│●🪺┃البرمجه:* Phyton - JS
*│┘────────────┈ـɪ ⳹*
*┊ 『  المستخدمات /  克 الأموال 』*
*┊↜✗• طاقه :* ◞⚡◜
*┊↜✗•الماس :* ◞💎◜
*┊↬✗•عملات  :* ◞🪙 ◜
*┘–––––––––––––––––❖ـ*

*┐–––––––––––––––––✥ـ*
*│ـ『 ℹ️ الأسـاسـيـات 』*
*┘┬❖ـ*
*┐├ـ*
*┊│●🧰⦆ .صلح*
*┊│●♻️⦆ .ابلاغ*
*┊│●👨🏻‍💻⦆ .المطور*
*┊│●👑⦆ .المملكه*
*┊│●🔰⦆ .الاسقبال*
*┊│●📚⦆ .تعليم*
*┊│●🍁⦆ .الدعم*
*┊│●💥⦆ .المالك*
*┊│●💥⦆ .لوجوهات*
*┊│●👥⦆ .الجروبات*
*┊│●🌸⦆ .البوتات*
*│┘────────────┈ـɪ ⳹*
*┘–––––––––––––––––✥ـ*

*┐*–––––––––––––––––✥ـ*
*│ـ『 🕌 الـديـنـي 🕋 』*
*┘┬❖ـ*
*┊│●🕌⦆ .ايه*
*┊│●🕋⦆ .قران*
*┊│●🕌⦆ .حديث*
*┊│●🕋⦆ .الله*
*│┘────────────┈ـɪ ⳹*
*┘–––––––––––––––––✥ـ*

*┐–––––––––––––––––✥ـ*
*│ـ『🗣️ ذكـاء اصطناعي 🧾 』*
*┘┬❖ـ*
*┐├ـ*
*┊│●👥⦆ .فينوم*
*┊│●👥⦆ .سوكونا*
*┊│●👥⦆ .ارسم*
*┊│●👥⦆ .تحدث*
*┊│●👥⦆ .بارد*
*┊│●👥⦆ .سيري*
*┊│●👥⦆ .احسب*
*┊│●👥⦆ .ايميل*
*┊│●👥⦆ .فيك*
*┊│●👥⦆ .حجم*
*│┘────────────┈ـɪ ⳹*
*┘–––––––––––––––––✥ـ*

*┐–––––––––––––––––✥ـ*
*│ـ『 ⚜️ الـمـجـمـوعـات ⚜️ 』*
*┘┬❖ـ*
*┐├ـ*
*┊│●💅🏻⦆ .اضف*
*┊│●🦵🏻⦆ .طرد*
*┊│●📌⦆ .ترقيه*
*┊│●📌⦆ .خفض*
*┊│●📌⦆ .تغير-الاسم*
*┊│●📌⦆ .تغير-الوصف*
*┊│●📌⦆ .تغير-الصوره*
*┊│●📌⦆ .منشن*
*┊│●📌⦆ .مخفي*
*┊│●🔓⦆ .جروب قفل*
*┊│●🔒⦆ .جروب فتح*
*┊│●📌⦆ .الجروب*
*┊│●📌⦆ .الادمن*
*┊│●📌⦆ .حذف*
*│┘────────────┈ـɪ ⳹*
*┘–––––––––––––––––✥ـ*

*┐–––––––––––––––––✥ـ*
*│ـ『 🎮 الالــعـابـــ 🎮 』*
*┘┬❖ـ*
*┐├ـ*
*┊│●🕹️⦆ .اكس*
*┊│●🕹️⦆ .تحدي*
*┊│●🕹️⦆ .حظ1*
*┊│●🕹️⦆ .حظ2*
*┊│●🕹️⦆ .حظ3*
*┊│●🕹️⦆ .فعاليات*
*┊│●🕹️⦆ .رياضه*
*┊│●🕹️⦆ .دين*
*┊│●🕹️⦆ .خمن*
*┊│●🕹️⦆ .انمي*
*┊│●🕹️⦆ .كت*
*┊│●🕹️⦆ .فكك*
*┊│●🕹️⦆ .ايمواجي*
*┊│●🕹️⦆ .رتب*
*┊│●🕹️⦆ .علم*
*┊│●🕹️⦆ .عين*
*┊│●🕹️⦆ .احزر*
*┊│●🕹️⦆ .كوره*
*┊│●🕹️⦆ .شخصية*
*┊│●🕹️⦆ .الحب*
*┊│●🕹️⦆ .الكره*
*┊│●🕹️⦆ .زواج*
*┊│●🕹️⦆ .طلاق*
*┊│●🕹️⦆ .قدوتي*
*┊│●🕹️⦆ .لعبة*
*┊│●🕹️⦆ .موتتي*
*┊│●🕹️⦆ .نسبه-شاذ*
*┊│●🕹️⦆ .نسبه-هدوء*
*┊│●🕹️⦆ .نسبه-ذكاء*
*┊│●🕹️⦆ .نسبه-قبح*
*│┘────────────┈ـɪ ⳹*
*┘–––––––––––––––––✥ـ*

*┐–––––––––––––––––✥ـ*
*│ـ『 👥 الاعـضـاء 』*
*┘┬❖ـ*
*┐├ـ*
*┊│●👫⦆ .تطقيم*
*┊│●👭⦆ .طقم*
*┊│●👬⦆ .طقمي*
*┊│●🛒⦆ .بروفايل*
*┊│●🖼️⦆ .خلفيه*
*┊│●📸⦆ .ميمز*
*┊│●🎈⦆ .سرعه*
*┊│●🗺️⦆ .ترجم*
*┊│●⛱️⦆ .زخرفه*
*┊│●⛱️⦆ .دمج*
*┊│●🌌⦆ .ملصق*
*┊│●🌌⦆ .استيكر*
*┊│●🌊⦆ .سرقه*
*┊│●🌊⦆ .ستك*
*┊│●🏜️⦆ .الطقس*
*┊│●🏜️⦆ .توب*
*┊│●⛩️⦆ .جوده*
*┊│●⛩️⦆ .تليجراف*
*┊│●🎄⦆ .لصوره*
*┊│●🎄⦆ .لفيديو*
*┊│●🧸⦆ .لانمي*
*┊│●🧸⦆ .ميسي*
*┊│●⚽⦆ .رونالدو*
*┊│●⚽⦆ .كيوت*
*│┘────────────┈ـɪ ⳹*
*┘–––––––––––––––––✥ـ*

*┐–––––––––––––––––✥ـ*
*│ـ『 🗃️ الـتـنـزيـلات 』*
*┘┬❖ـ*
*┐├ـ*
*┊│●📽️⦆ .يوتيوب*
*┊│●📽️⦆ .فيديو*
*┊│●🎧⦆ .اغنيه*
*┊│●📽️⦆ .تيك*
*┊│●🎥⦆ .فيسبوك*
*┊│●👾⦆ .تطبيق*
*┊│●👾⦆ .بحث*
*┊│●🎨⦆ .صوره*
*┊│●🎨⦆ .جوجل*
*│┘────────────┈ـɪ ⳹*
*┘–––––––––––––––––✥ـ*

*┐–––––––––––––––––✥ـ*
*│ـ『 🏖️ لـوجـوهـات 』*
*┘┬❖ـ*
*┐├ـ*
*┊│●🦚⦆ .لوجوهات*
*┊│●🦚⦆ .لوجو-حب*
*┊│●🦚⦆ .تصميم1*
*┊│●🦚⦆ .تصميم2*
*┊│●🦚⦆ .تصميم3*
*┊│●🌊⦆ .لوجو بحر*
*┊│●🌊⦆ .لوجو امريكا*
*┊│●🌊⦆ .لوجو خيال1*
*┊│●🌊⦆ .لوجو قوس-قزح*
*┊│●🌊⦆ .لوجو ماء*
*┊│●🗼⦆ .لوجو عظمي*
*┊│●🗼⦆ .لوجو هالوين*
*┊│●🗼⦆ .لوجو رعب*
*┊│●🗼⦆ .لوجو تخطيط*
*┊│●🗼⦆ .لوجو فضاءي*
*┊│●🗼⦆ .لوجو فضاء*
*┊│●🍧⦆ .لوجو معدني*
*┊│●🍧⦆ .لوجو معدني2*
*┊│●🍭⦆ .لوجو كامريكا*
*┊│●🍭⦆ .لوجو خيال2*
*┊│●🍭⦆ .لوجو كلاسيكي*
*┊│●🐋⦆ .لوجو رعب-اخضر*
*┊│●🐋⦆ .لوجو محول*
*┊│●🐳⦆ .لوجو توت*
*┊│●🐋⦆ .لوجو الطبقات*
*┊│●🐋⦆ .لوجو رعد*
*┊│●🚀⦆ .لوجو صهريج*
*┊│●🚀⦆ .لوجو حجر*
*┊│●🚀⦆ .لوجو جولد3*
*┊│●🚀⦆ .لوجو عطل*
*┊│●🚀⦆ .لوجو خلل*
*┊│●♻️⦆ .لوجو سطح*
*┊│●♻️⦆ .لوجو زجاج*
*┊│●♻️⦆ .لوجو ورق*
*┊│●♻️⦆ .لوجو ابيض-اسود*
*┊│●♻️⦆ .لوجو انترنت*
*┊│●📍⦆ .لوجو معدني2*
*┊│●📍⦆ .لوجو لوحة*
*┊│●📍⦆ .لوجو قصص*
*┊│●📍⦆ .لوجو ضباب*
*┊│●📍⦆ .لوجو شيطاني*
*┊│●📍⦆ .لوجو محيط*
*┊│●🧿⦆ .لوجو شعار*
*┊│●🧿⦆ .لوجو جرافيت1*
*┊│●🧿⦆ .لوجو جرافيت2*
*┊│●🧿⦆ .لوجو جرافيت3*
*┊│●🧿⦆ .لوجو جرافيت4*
*┊│●🧿⦆ .لوجو ثلج*
*┊│●🍉⦆ .لوجو تكنولوجيا*
*┊│●🍉⦆ .لوجو شتاء*
*┊│●🍉⦆ .لوجو سحابه*
*┊│●🍉⦆ .لوجو ذهب*
*┊│●🍉⦆ .لوجو تدرج*
*┊│●🍉⦆ .لوجو بلاكبينك*
*┊│●🍉⦆ .لوجو مصباح*
*┊│●⛲⦆ .لوجو سحابة1*
*┊│●⛲⦆ .لوجو سحابة2*
*┊│●⛲⦆ .لوجو رمل1*
*┊│●⛲⦆ .لوجو رمل2*
*┊│●⛲⦆ .لوجو نقش*
*┊│●⛲⦆ .لوجو رمل3*
*┊│●⛲⦆ .لوجو بالون*
*┊│●📣⦆ .لوجو لاصق*
*┊│●📣⦆ .لوجو فضائي*
*┊│●📣⦆ .لوجو ذهب-داكن*
*┊│●📣⦆ .لوجو تيكتوك*
*┊│●📣⦆ .لوجو نيون*
*┊│●📣⦆ .لوجو جلاكسيي*
*┊│●📣⦆ .لوجو 1917-ستيل*
*┊│●📣⦆ .لوجو قديم*
*┊│●🎈⦆ .لوجو ديناميكي*
*┊│●🎈⦆ .لوجو بنهاب*
*┊│●🎈⦆ .لوجو مزدوج*
*┊│●🎈⦆ .لوجو هولوجرافي*
*┊│●🎈⦆ .لوجو الافنجرز*
*┊│●🎈⦆ .وجو الاجواني*
*┊│●🎈⦆ .لوجو مارفل*
*┊│●🎈⦆ .لوجو فضة*
*┊│●🎏⦆ .لوجو فضة2*
*┊│●🎏⦆ .لوجو معادن*
*┊│●🎏⦆ .لوجو جولد*
*┊│●🎏⦆ .جو جولد2*
*┊│●🎏⦆ .وجو كربون*
*┊│●🎏⦆ .لوجو نسيج*
*┊│●⛱️⦆ .لوجو نينون*
*┊│●⛱️⦆ .لوجو عيد1*
*┊│●⛱️⦆ .وجو عيد2*
*┊│●⛱️⦆ .لوجو بالون3*
*┊│●⛱️⦆ .لوجو معادنن2*
*┊│●⛱️⦆ .لوجو جولد3*
*│┘────────────┈ـɪ ⳹*
*┘–––––––––––––––––✥ـ*

*┐–––––––––––––––––✥ـ*
*│ـ『 🏔️ الـبـنـك 🏩 』*
*┘┬❖ـ*
*┐├ـ*
*┊│●🏦⦆ .راتب*
*┊│●🏦⦆ .يومي*
*┊│●🏦⦆ .اسبوعي*
*┊│●🏦⦆ .شهري*
*┊│●🏦⦆ .هديتي*
*┊│●🏩⦆ .تحويل*
*┊│●🏩⦆ .لفل*
*┊│●🏩⦆ .خبرات*
*┊│●🏩⦆ .رصيدي*
*┊│●🏩⦆ .الماسي*
*│┘────────────┈ـɪ ⳹*
*┘–––––––––––––––––✥ـ*

*┐–––––––––––––––––✥ـ*
*│ـ『 🎙️ الاصـوات 🗻 』*
*┘┬❖ـ*
*┐├ـ*
*┊│●🎶⦆ .رفيع*
*┊│●🎶⦆ .تخين*
*┊│●🎶⦆ .تخينن*
*┊│●🎶⦆ .صاخب*
*┊│●🎶⦆ .ناعم*
*┊│●🎶⦆ .سنجاب*
*┊│●🎶⦆ .روبوت*
*┊│●🎶⦆ .منفوخ*
*┊│●🎶⦆ .عميق*
*┊│●🎶⦆ .بطيء*
*┊│●🎶⦆ .سريع*
*│┘────────────┈ـɪ ⳹*
*┘–––––––––––––––––✥ـ*

*┐–––––––––––––––––✥ـ*
*│ـ『 ⚡ حـصـري 🐞 』*
*┘┬❖ـ*
*┐├ـ*
*┊│●🎡⦆ .جيب*
*┊│●🎡⦆ .دونات*
*┊│●🎡⦆ .قلوب*
*┊│●🎡⦆ .ابعت*
*┊│●🎡⦆ .فعاليات*
*┊│●♻️⦆ .مارد*
*│┘────────────┈ـɪ ⳹*
*┘–––––––––––––––––✥ـ*
`;
   await conn.sendMessage(m.chat, {text: txt.trim(), mentions: [...txt.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net'), contextInfo: {forwardingScore: 9999999, isForwarded: true, mentionedJid: [...txt.matchAll(/@([0-9]{5,16}|0)/g)].map((v) => v[1] + '@s.whatsapp.net'), "externalAdReply": {"showAdAttribution": true, "containsAutoReply": true, "renderLargerThumbnail": true, "title": '乂 ✨🌸 𝑀𝑖𝑡𝑠𝑢𝑟𝑖 𝐵𝑜𝑡 🌸✨ 乂', "containsAutoReply": true, "mediaType": 1, "thumbnail": [imagen6,imagen1,imagen4].getRandom(), "mediaUrl": global.gp1, "sourceUrl": global.gp1}}}, {quoted: fkon});
 // m.react('🎮');
  } catch {
    conn.reply(m.chat, '*❗ حـدث خـطـاء*', m);
  }
}; 
handler.help = ['menuuu'];
handler.tags = ['mmmmenu'];
handler.command = /^(المهام)$/i;
export default handler;
function clockString(ms) {
  const h = isNaN(ms) ? '--' : Math.floor(ms / 3600000);
  const m = isNaN(ms) ? '--' : Math.floor(ms / 60000) % 60;
  const s = isNaN(ms) ? '--' : Math.floor(ms / 1000) % 60;
  return [h, m, s].map((v) => v.toString().padStart(2, 0)).join(':');
}