
let handler = async (m, { conn, usedPrefix, command }) => {
    try {
        let venom12 = `
┐┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⪦ ـ
┊⩥🍰│مـتـجـر الـبـوت
┘┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⪦ـ
┐┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⪦ ـ
*⟣⟤🎡 #عروض*
*ـ⫹ 0 💎⫺*
*⧕ بـيـجـبـلـك عـروض لـربـح الـمـاس*
┘┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⪦ـ
┐┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⪦ ـ
*⟣⟤🚀 #نسخه --كود*
*ـ⫹ 60000 💎⫺*
*⧕ بـيـعـمـلـك بـوت عـلـي رقـمـك اكـتـب ~#تعلم~ لـتـفـهـم الـمـزيـد  👾🔥*
┘┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⪦ـ
┐┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⪦ ـ
*⟣⟤🎃 #ادخلي*
*ـ⫹ 10000 💎⫺*
*⧕ بـيـدخـل الـبـوت جـروبـك*
┘┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⪦ـ
┐┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⪦ ـ
*⟣⟤🎈 #اعلان*
*ـ⫹ 9000 💎⫺*
*⧕ بـيـعـمـلـك اعـلان فـي جـروبـات الـبـوت*
┘┄┄┄┄┄┄┄┄┄┄┄┄┄┄┄⪦ـ
`;

        const venomURL8 = 'https://telegra.ph/file/32e13c3fbb96f5d08f2d0.png';

        await conn.sendMessage(m.chat, { image: { url: venomURL8 }, caption: venom12 });
    } catch (error) {
        console.log(error);
    }
};

handler.command = /^متجر|المتجر$/i;

export default handler;